#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Shafiul-Shop/relay42/runs/run-brNrmUsaw9Z2YpNh

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_string.random: Refreshing state... [id=jJImr/yH]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-031245b03afca330b]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0686dd1a1b1674f92]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-092579ba243d3924e]
module.vpc.aws_vpc_ipv4_cidr_block_association.this[0]: Refreshing state... [id=vpc-cidr-assoc-0eefb9bbf944ad726]
module.ec2_bastion_prod_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0b06f531046549963]
module.vpc.aws_vpc_ipv4_cidr_block_association.this[1]: Refreshing state... [id=vpc-cidr-assoc-05d731301067254e4]
module.application_ec2_multiple_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03b67676aefdc6a35]
module.loadbalancer_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0c435b32cdd4d880a]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0056896f4bc59b861]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-00a7c393f31acd4ca]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0c08d6723ea7eb2a7]
module.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-07a0a640537b3cabb]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-01a878219aff66a2c]
module.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-0650b0727bd4e1f8e]
module.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-0745b0f1ecae980ee]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ee7c3657a0163f88]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-028b197b707d7fabd]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-09ef6c97c532eb2bf]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06a163854410fb83b]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-03e7b8255d29a93a4]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00f81763bd323f0f2]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0fa709155b04e100d]
module.application_ec2_multiple_sg.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-3724887445]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0c08d6723ea7eb2a71080289494]
module.application_ec2_multiple_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1386085501]
module.application_ec2_multiple_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1422298045]
module.ec2_bastion_prod_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1141659139]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=vpc-prod]
module.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-024b100dc3267d2e8]
module.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-0ff488c1b57a16ae5]
module.ec2_bastion_prod_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-765909566]
module.loadbalancer_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1132359896]
module.loadbalancer_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1730530921]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0c97c9d82319b0490]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0342ba74ddcecaa18]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03d7fe0d37042af61]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0080e04fb141060a1]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dd2a4864e0344953]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0af58a7f8b13b71f1]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-044ce843ffec5036d]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0778167a655a35abe]
module.ec2_bastion_prod.aws_instance.this[0]: Refreshing state... [id=i-0ce63ed03c63a2853]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:499618069435:loadbalancer/app/IT-prod-alb/5864dd81cd40b25e]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-03e7b8255d29a93a41080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06a163854410fb83b1080289494]
module.application_ec2_multiple["app1"].aws_instance.this[0]: Refreshing state... [id=i-02cf23c3ae4562942]
module.application_ec2_multiple["app2"].aws_instance.this[0]: Refreshing state... [id=i-0330120b2851d5b17]
aws_eip.prod-bastion-eip: Refreshing state... [id=eipalloc-07425e29d8360a752]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:499618069435:targetgroup/app-20220320064410603000000004/c2d1e75e50b5aa23]
module.alb.aws_lb_target_group_attachment.this["0.1"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:499618069435:targetgroup/app-20220320064410603000000004/c2d1e75e50b5aa23-20220320064413439200000006]
module.alb.aws_lb_target_group_attachment.this["0.0"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:499618069435:targetgroup/app-20220320064410603000000004/c2d1e75e50b5aa23-20220320064412868700000005]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:499618069435:listener/app/IT-prod-alb/5864dd81cd40b25e/80098885545b0e50]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.alb_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "alb_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors ALB HTTP 4xx errors counts if exceeds to 120"
      + alarm_name                            = "App-ALB-HTTP-4xx-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "LoadBalancer" = "app/IT-prod-alb/5864dd81cd40b25e"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_Target_4XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 120
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 120
      + treat_missing_data                    = "missing"
    }

  # aws_sns_topic.alb_sns_topic will be created
  + resource "aws_sns_topic" "alb_sns_topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = (known after apply)
    }

  # aws_sns_topic_subscription.alb_sns_topic_subscription will be created
  + resource "aws_sns_topic_subscription" "alb_sns_topic_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "akmshasan@gmail.com"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # random_string.random must be replaced
-/+ resource "random_string" "random" {
      ~ id               = "jJImr/yH" -> (known after apply)
      - override_special = "/@£$" -> null # forces replacement
      ~ result           = "jJImr/yH" -> (known after apply)
      ~ special          = true -> false # forces replacement
        # (8 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 1 to destroy.


```
</details>
*Pusher: @akmshasan, Action: `pull_request`*